Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 39, 531, 1)] 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 39, 531, 768) 7680        input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 39, 531, 768) 5309184     conv2d[0][0]                     
__________________________________________________________________________________________________
add (Add)                       (None, 39, 531, 768) 0           conv2d_1[0][0]                   
                                                                 conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 39, 531, 768) 0           add[0][0]                        
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 20, 266, 768) 9437952     activation[0][0]                 
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 20, 266, 768) 5309184     conv2d_2[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 20, 266, 768) 0           conv2d_3[0][0]                   
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 20, 266, 768) 0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 20, 266, 768) 5309184     activation_1[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 20, 266, 768) 0           conv2d_4[0][0]                   
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 20, 266, 768) 0           add_2[0][0]                      
__________________________________________________________________________________________________
dense (Dense)                   (None, 20, 266, 768) 590592      activation_2[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, 20, 266, 768) 0           dense[0][0]                      
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 20, 266, 768) 0           add_3[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 20, 266, 768) 590592      activation_3[0][0]               
__________________________________________________________________________________________________
add_4 (Add)                     (None, 20, 266, 768) 0           dense_1[0][0]                    
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 20, 266, 768) 0           add_4[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 20, 266, 768) 590592      activation_4[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, 20, 266, 768) 0           dense_2[0][0]                    
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 20, 266, 768) 0           add_5[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 20, 266, 768) 590592      activation_5[0][0]               
__________________________________________________________________________________________________
add_6 (Add)                     (None, 20, 266, 768) 0           dense_3[0][0]                    
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 20, 266, 768) 0           add_6[0][0]                      
==================================================================================================
Total params: 27,735,552
Trainable params: 27,735,552
Non-trainable params: 0
__________________________________________________________________________________________________
