Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 39, 1699, 1) 0                                            
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 39, 1699, 768 3072        input_2[0][0]                    
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 39, 1699, 768 1770240     conv1d_5[0][0]                   
__________________________________________________________________________________________________
add_7 (Add)                     (None, 39, 1699, 768 0           conv1d_6[0][0]                   
                                                                 conv1d_5[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 39, 1699, 768 0           add_7[0][0]                      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 39, 850, 768) 2360064     activation_7[0][0]               
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 39, 850, 768) 1770240     conv1d_7[0][0]                   
__________________________________________________________________________________________________
add_8 (Add)                     (None, 39, 850, 768) 0           conv1d_8[0][0]                   
                                                                 conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 39, 850, 768) 0           add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 39, 850, 768) 1770240     activation_8[0][0]               
__________________________________________________________________________________________________
add_9 (Add)                     (None, 39, 850, 768) 0           conv1d_9[0][0]                   
                                                                 activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 39, 850, 768) 0           add_9[0][0]                      
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 39, 850, 768) 590592      activation_9[0][0]               
__________________________________________________________________________________________________
add_10 (Add)                    (None, 39, 850, 768) 0           dense_4[0][0]                    
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 39, 850, 768) 0           add_10[0][0]                     
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 39, 850, 768) 590592      activation_10[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 39, 850, 768) 0           dense_5[0][0]                    
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 39, 850, 768) 0           add_11[0][0]                     
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 39, 850, 768) 590592      activation_11[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 39, 850, 768) 0           dense_6[0][0]                    
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 39, 850, 768) 0           add_12[0][0]                     
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 39, 850, 768) 590592      activation_12[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, 39, 850, 768) 0           dense_7[0][0]                    
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 39, 850, 768) 0           add_13[0][0]                     
==================================================================================================
Total params: 10,036,224
Trainable params: 10,036,224
Non-trainable params: 0
__________________________________________________________________________________________________
